[
  {
    "title": "BITNAP",
    "tags": [
      "app",
      "concept",
      "design",
      "figma",
      "ui/ux",
      "react",
      "mobile development"
    ],
    "image": "bitnap.png",
    "date": "ongoing",
    "role": "designer/developer",
    "summary": "A collaborative iOS dream journal app concept focused on symbolism, mood tracking, and chaos. Designed in Figma and currently in development using React. Future plans include AI-powered dream analysis and integrations with Apple Health.",
    "details": {
      "plan_wireframes": {
        "text": "The initial plan for Bitnap came out of a chaotic brainstorm around symbolic dream tracking and generative art. Wireframes were designed in Figma to simulate a retrofuturistic dream terminal — complete with fake glitch lines, tag-based navigation, and subtle pixel art vibes.",
        "images": [
          "bitnap-wireframe1.png",
          "bitnap-wireframe2.png"
        ]
      },
      "dev_method": {
        "text": "Bitnap is being built in React using Vite. Mood tagging, symbol frequency tracking, and journal prompts are handled through reusable components and state management hooks. Eventually, AI-generated dream insights and HealthKit data integration are planned.",
        "images": [
          "bitnap-dev1.png",
          "bitnap-dev2.png"
        ]
      },
      "final_version": {
        "text": "Still in development. Final version will feature mood-based theming, recurring symbol analytics, and dreamy transitions. Designed to help chaotic brains bring a little narrative to the mess.",
        "images": [
          "bitnap-final1.png"
        ]
      }
    }
  },
  {
    "title": "DISINFOQUEST",
    "tags": [
      "React",
      "Game development",
      "website",
      "Pixel Art",
      "cybersecurity"
    ],
    "image": "disinfoquest.png",
    "date": "May 2025",
    "role": "designer/developer",
    "summary": "A gamified educational tool built entirely in React, designed to help 18–25 year olds recognise online radicalisation and misinformation.",
    "details": {
      "plan_wireframes": {
        "text": "Figma wireframes mapped out various 'quest' paths, including fake chatrooms and sketchy social media posts. Each route ends in a different consequence, based on user choices.",
        "images": [
          "disinfoquest-wire1.png",
          "disinfoquest-wire2.png"
        ]
      },
      "dev_method": {
        "text": "Built in React with page-based routing and conditional rendering to simulate game progression. Used inline pixel art and CSS animations for style.",
        "images": [
          "disinfoquest-dev1.png"
        ]
      },
      "final_version": {
        "text": "Playable browser demo includes easter eggs, fake account profiles, and a points system. Designed to be chaotic and engaging to keep young users hooked.",
        "images": [
          "disinfoquest-final1.png"
        ]
      }
    }
  },
  {
    "title": "UNGAK",
    "tags": [
      "Adobe",
      "Photoshop",
      "Concept Art",
      "Landing Page",
      "Design"
    ],
    "image": "ungak.png",
    "date": "May 2020",
    "role": "designer",
    "summary": "A Photoshop-based concept landing page designed for Ungak, a visual/graphic artist.",
    "details": {
      "plan_wireframes": {
        "text": "Initial sketches explored grunge and experimental art vibes to match the artist's online aesthetic. Mockups featured layered textures, muted tones, and geometric placements.",
        "images": [
          "ungak-wire1.png"
        ]
      },
      "dev_method": {
        "text": "Fully designed in Adobe Photoshop and Illustrator. Exported layered comps for future dev handoff.",
        "images": [
          "ungak-dev1.png"
        ]
      },
      "final_version": {
        "text": "Static concept delivery with final mockups and style guides. Not deployed but used as reference for portfolio branding.",
        "images": [
          "ungak-final1.png"
        ]
      }
    }
  },
  {
    "title": "HIRAETH",
    "tags": [
      "Unity",
      "Game Development",
      "C#",
      "Game Design",
      "Demo"
    ],
    "image": "hiraeth.png",
    "date": "May 2021",
    "role": "designer/developer",
    "summary": "A collaborative narrative game demo with a soft glitchcore aesthetic and heavy lore energy.",
    "details": {
      "plan_wireframes": {
        "text": "Storyboarding and world design sketches emphasized themes of loss, liminality, and memory. Created character sheets and environment mockups.",
        "images": [
          "hiraeth-wire1.png"
        ]
      },
      "dev_method": {
        "text": "Built in Unity using C#. Dialog and cutscenes were handled using Ink, and all assets were imported via custom pipelines. Code handled basic collision, narrative triggers, and audio effects.",
        "images": [
          "hiraeth-dev1.png"
        ]
      },
      "final_version": {
        "text": "Playable short demo with glitch transitions, ambient soundtrack, and introspective tone. Used for university showcase.",
        "images": [
          "hiraeth-final1.png"
        ]
      }
    }
  },
  {
    "title": "GOOD FOR YOU",
    "tags": [
      "rebrand",
      "Adobe",
      "HTML",
      "CSS",
      "Design"
    ],
    "image": "goodforyou.png",
    "date": "Oct 2024",
    "role": "designer/developer",
    "summary": "A full rebrand and digital strategy for a local beauty salon, including logo, print, and web.",
    "details": {
      "plan_wireframes": {
        "text": "Client questionnaire helped define target audience and visual goals. Wireframes designed with a clean, soft palette and luxury-lite vibe.",
        "images": [
          "gfu-wire1.png"
        ]
      },
      "dev_method": {
        "text": "Logo and brand guidelines created in Illustrator. Website built using vanilla HTML/CSS with light JS animations and a third-party booking tool integration.",
        "images": [
          "gfu-dev1.png"
        ]
      },
      "final_version": {
        "text": "Live site delivered with responsive design, social links, and custom-printed flyers for in-store display.",
        "images": [
          "gfu-final1.png"
        ]
      }
    }
  },
  {
    "title": "NEO'S PIZZA",
    "tags": [
      "Design",
      "Rebrand",
      "photoshop",
      "illustrator",
      "print",
      "social media"
    ],
    "image": "neos.png",
    "date": "ongoing",
    "role": "designer/social media content creator",
    "summary": "Ongoing design support for a local pizza shop: print, menu, posters, social media templates.",
    "details": {
      "plan_wireframes": {
        "text": "Developed a retro but bold visual identity, with loud graphics and hand-drawn icons to match the owner's vibe.",
        "images": [
          "neos-wire1.png"
        ]
      },
      "dev_method": {
        "text": "Assets created in Illustrator and Photoshop. Templates for weekly deals and stories delivered via Canva and PSDs.",
        "images": [
          "neos-dev1.png"
        ]
      },
      "final_version": {
        "text": "Regularly updated IG carousel posts, in-store menus, and flyers. Brand voice is casual and slightly unhinged (like the owner).",
        "images": [
          "neos-final1.png"
        ]
      }
    }
  },
  {
    "title": "TOP NOTCH CLEANING",
    "tags": [
      "Design",
      "Rebrand",
      "website",
      "HTML",
      "CSS",
      "JavaScript",
      "WordPress"
    ],
    "image": "tncc.png",
    "date": "July 2025",
    "role": "designer/developer",
    "summary": "A branding and website overhaul for a local cleaning business, focused on clarity and professionalism.",
    "details": {
      "plan_wireframes": {
        "text": "Moodboards helped identify clean, airy visual language. UX flow was designed around quick quote requests and mobile visibility.",
        "images": [
          "tncc-wire1.png"
        ]
      },
      "dev_method": {
        "text": "Custom theme in WordPress using HTML, CSS, and JS. Installed plugins for contact forms, testimonials, and Google Maps.",
        "images": [
          "tncc-dev1.png"
        ]
      },
      "final_version": {
        "text": "Site handed off with training docs. Business cards, email templates, and a style guide were included in final deliverables.",
        "images": [
          "tncc-final1.png"
        ]
      }
    }
  },
  {
    "title": "QUOTES APP",
    "tags": [
      "design",
      "website",
      "HTML",
      "CSS",
      "JavaScript",
      "python",
      "replit"
    ],
    "image": "quotesapp.png",
    "date": "May 2022",
    "role": "designer/developer",
    "summary": "A quote-saving app built in Replit with clean UI and basic user input functionality.",
    "details": {
      "plan_wireframes": {
        "text": "Simple paper sketches evolved into a clean digital UI with typography-inspired layout.",
        "images": [
          "quotes-wire1.png"
        ]
      },
      "dev_method": {
        "text": "HTML/CSS frontend with JavaScript interactivity. Python backend handled user submission logic and saving quotes.",
        "images": [
          "quotes-dev1.png"
        ]
      },
      "final_version": {
        "text": "Deployed on Replit. User can view, add, and remove quotes in real time. Bookish aesthetic and responsive layout.",
        "images": [
          "quotes-final1.png"
        ]
      }
    }
  }
]